if __name__ == '__main__':
    a1 = Goods("Товар", "дата", 1000, 10, "накладная")
    a2 = Goods("Товар", "дата", 500, 5, "накладная")

    print(f"{a1}")
    print()
    print(f"{a2}")

    print(f"количество1 < количество2: {a1 < a2}")
    print(f"количество1 > количество2: {a1 > a2}")
    print(f"количество1 != количество2: {a1 != a2}")
    print(f"количество1 == количество2: {a1 == a2}")
    print(f"количество1 >= количество2: {a1 >= a2}")
    print(f"количество1 <= количество2: {a1 <= a2}\n")

    print(f"{a1 + a2}")
    print(f"{a1 - a2}")
    print(f"Старая сумма, новая сумма = {a1 * a2}")
